app/Controllers/Auth.php

    public function processLogin()
    {
        $session = session();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();

        if ($user) {
            if (password_verify($password, $user['password'])) {
                if ($user['status'] == 1) {
                    $session->set([
                        'user_id' => $user['id'],
                        'email' => $user['email'],
                        'first_name' => $user['first_name'],
                        'last_name' => $user['last_name'],
                        'isLoggedIn' => true,
                        'userType' => $user['user_type']
                    ]);

                    // Delete all records in current_user table
                    $db = \Config\Database::connect();
                    $builder = $db->table('current');
                    $builder->truncate();

                    // Insert current user record
                    $builder->insert([
                        'user_id' => $user['id'],
                        'first_name' => $user['first_name'],
                        'last_name' => $user['last_name'],
                        'email' => $user['email']
                    ]);
---
SELECT *
FROM `users`
WHERE `email` = 'ctorno30@gmail.com'
 LIMIT 1
INSERT INTO `current` (`user_id`, `first_name`, `last_name`, `email`) VALUES ('49', 'ITSO', 'ADMIN 2', 'ctorno30@gmail.com')