app/Controllers/Borrow.php

UPDATE `equipment` SET `status` = 'Active'
WHERE `equipment`.`id` IN ('PN-003')
---
    public function borrow_items()
    {
        $equipmentModel = new EquipmentModel();
        $borrowedItemModel = new BorrowedItemModel();
        $data = $this->request->getJSON();
        $userEmail = session()->get('email'); // Get the user's email from the session

        foreach ($data->items as $item) {
            $setItem = $item->item_id;

            // Check if the item exists
            $itemExists = $equipmentModel->where('item_id', $setItem)->first();
            if (!$itemExists) {
                log_message('error', 'Item ID not found: ' . $setItem);
                return $this->response->setJSON(['success' => false, 'error' => 'Item not found.']);
            }

            // Update item status to 'Active'
            if (!$equipmentModel->update($itemExists['id'], ['status' => 'Active'])) {