app/Controllers/Borrow.php

INSERT INTO `borrowed_item` (`item_id`, `borrow_date`, `user_id`, `return_date`) VALUES ('PN-003', '2024-12-01', '50', NULL)
---
    public function borrow_items()
    {
        $equipmentModel = new EquipmentModel();
        $borrowedItemModel = new BorrowedItemModel();
        $data = $this->request->getJSON();

        foreach ($data->items as $item) {
            // Update item status to 'Active'
            $equipmentModel->update($item->item_id, ['status' => 'Active']);

            // Save borrow record
            $borrowedItemModel->save([
                'item_id' => $item->item_id,
                'borrow_date' => $item->borrow_date,
                'user_id' => session()->get('user_id'), // Assuming user_id is stored in session
                'return_date' => null // Initial return date is null
            ]);