app/Controllers/EquipmentManagement.php

    public function index()
    {
        $session = session();
        if ($session->get('userType') != 'ITSO_Personnel') {
            return redirect()->to('/');
        }

        $equipmentModel = new EquipmentModel();
        $data['equipment'] = $equipmentModel->findAll();
---
SELECT *
FROM `equipment`

    public function getLastItemID($prefix)
    {
        $equipmentModel = new EquipmentModel();
        $lastItem = $equipmentModel->where('item_id LIKE', "$prefix%")->orderBy('item_id', 'DESC')->first();
---
SELECT *
FROM `equipment`
WHERE `item_id` LIKE 'LPTP%'
ORDER BY `item_id` DESC
 LIMIT 1