app/Controllers/Reports.php

    public function index()
    {
        $session = session();
        if ($session->get('userType') != 'ITSO_Personnel') {
            return redirect()->to('/');
        }

        $userModel = new UserModel();
        $equipmentModel = new EquipmentModel();
        $borrowedItemModel = new BorrowedItemModel();

        $totalUsers = $userModel->countAllResults();
        $totalItems = $equipmentModel->countAllResults();

        // Fetch data for pie charts
        $stockData = $equipmentModel->select('category, COUNT(*) as total')
                                    ->where('status', 'Stock')
                                    ->groupBy('category')
                                    ->findAll();

        $defectiveData = $equipmentModel->select('category, COUNT(*) as total')
                                        ->where('status', 'Defective')
                                        ->groupBy('category')
                                        ->findAll();

        $unusableEquipment = $equipmentModel->where('status', 'Defective')->findAll();
        $borrowingHistory = $borrowedItemModel->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `equipment`
SELECT `category`, COUNT(*) as total
FROM `equipment`
WHERE `status` = 'Stock'
GROUP BY `category`
SELECT `category`, COUNT(*) as total
FROM `equipment`
WHERE `status` = 'Defective'
GROUP BY `category`
SELECT *
FROM `equipment`
WHERE `status` = 'Defective'
SELECT *
FROM `borrowed_item`