app/Controllers/Reservation.php

    public function index()
    {
        $session = session();
        if ($session->get('userType') != 'Associate') {
            return redirect()->to('/'); // Redirect non-Associates
        }

        $reservationModel = new ReservationModel();
        $data['reservations'] = $reservationModel->where('email', $session->get('email'))->findAll();
---
SELECT *
FROM `reservations`
WHERE `email` = 'mitagof177@luxyss.com'

    public function create()
    {
        $equipmentModel = new EquipmentModel();
        $data['stockItems'] = $equipmentModel->where('status', 'Stock')->findAll();
---
SELECT *
FROM `equipment`
WHERE `status` = 'Stock'