app/Controllers/UserManagement.php

    public function index()
    {

        $session = session();
        if ($session->get('userType') != 'ITSO_Personnel') {
            return redirect()->to('/');
        }

        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();
---
SELECT *
FROM `users`